; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v2)
		(pred_1 ?v7)
		(pred_5 ?v4)
		(pred_2 ?v4)
		(pred_6 ?v7 ?v4)
		(pred_4)
		(pred_3 ?v7))

   (:action op_1
       :parameters  (?v3 ?v1)
       :precondition (and (not-eq ?v3 ?v1) 
                          (pred_5 ?v3) (pred_5 ?v1) (pred_2 ?v3))
       :effect (and  (pred_2 ?v1)
		     (not (pred_2 ?v3))))


   (:action op_2
       :parameters (?v8 ?v5)
       :precondition  (and  (pred_1 ?v8) (pred_5 ?v5)
			    (pred_6 ?v8 ?v5) (pred_2 ?v5) (pred_4))
       :effect (and (pred_3 ?v8)
		    (not (pred_6 ?v8 ?v5)) 
		    (not (pred_4))))

   (:action op_3
       :parameters  (?v8  ?v5)
       :precondition  (and  (pred_1 ?v8) (pred_5 ?v5)
			    (pred_3 ?v8) (pred_2 ?v5))
       :effect (and (pred_6 ?v8 ?v5)
		    (pred_4)
		    (not (pred_3 ?v8)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_04 obj_02 obj_05 
          obj_06 obj_01 obj_03 
)
(:init
(pred_5 obj_04)
(pred_5 obj_02)
(pred_5 obj_05)
(pred_1 obj_06)
(pred_1 obj_01)
(pred_1 obj_03)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(pred_4)
(pred_6 obj_06 obj_02)
(pred_6 obj_01 obj_05)
(pred_6 obj_03 obj_02)
(pred_2 obj_05)
)
(:goal
(and
(pred_6 obj_06 obj_05)
(pred_6 obj_01 obj_04)
(pred_6 obj_03 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_06 obj_05) (pred_2 obj_04))
    (sometime-before  (pred_6 obj_01 obj_04) (pred_2 obj_02))
    (sometime-before  (pred_6 obj_03 obj_04) (pred_2 obj_05))
  )
)
)

; plan
1. (op_2 obj_01 obj_05)
   deleted: (pred_6 obj_01 obj_05) (pred_4)
   added: (pred_3 obj_01)
   goals met: 0 of 3
2. (op_1 obj_05 obj_02)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_02)
   goals met: 0 of 3
3. (op_3 obj_01 obj_02)
   deleted: (pred_3 obj_01)
   added: (pred_6 obj_01 obj_02) (pred_4)
   goals met: 0 of 3
4. (op_2 obj_03 obj_02)
   deleted: (pred_6 obj_03 obj_02) (pred_4)
   added: (pred_3 obj_03)
   goals met: 0 of 3
5. (op_1 obj_02 obj_04)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_04)
   goals met: 0 of 3
6. (op_3 obj_03 obj_04)
   deleted: (pred_3 obj_03)
   added: (pred_6 obj_03 obj_04) (pred_4)
   goals met: 1 of 3
7. (op_1 obj_04 obj_02)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_02)
   goals met: 1 of 3
8. (op_2 obj_01 obj_02)
   deleted: (pred_6 obj_01 obj_02) (pred_4)
   added: (pred_3 obj_01)
   goals met: 1 of 3
9. (op_1 obj_02 obj_04)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_04)
   goals met: 1 of 3
10. (op_3 obj_01 obj_04)
   deleted: (pred_3 obj_01)
   added: (pred_6 obj_01 obj_04) (pred_4)
   goals met: 2 of 3
11. (op_1 obj_04 obj_02)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_02)
   goals met: 2 of 3
12. (op_2 obj_06 obj_02)
   deleted: (pred_6 obj_06 obj_02) (pred_4)
   added: (pred_3 obj_06)
   goals met: 2 of 3
13. (op_1 obj_02 obj_05)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_05)
   goals met: 2 of 3
14. (op_3 obj_06 obj_05)
   deleted: (pred_3 obj_06)
   added: (pred_6 obj_06 obj_05) (pred_4)
   goals met: 3 of 3
